{
    "categories": {
        "about": "About",
        "skills": "Skills",
        "projects": "Projects",
        "contact": "Contact",
        "language": "EN/FR"
    },
    "about": {
        "title1": "Hi! I'm Matias Larralde and I'm honored that you have a look on my Portfolio.",
        "sentence1": "I'm coming into the tech industry with a really varied background, from restoration, event setup or even urban farming.",
        "sentence2": "I grew a lot as a human being through these experiences and I'm glad to have acquired many skills that I can use into Web Development.",
        "sentence3": "Solving problems and building solutions, on my own or with teammates; as much as having a creative mindset and a strong attention to detail; are skills that become part of me now !",
        "sentence4": "That builds my thirst for learning and mastering new technologies, coding languages or frameworks. Each new day is a new challenge !",
        "sentence5": "I know I found my path into coding."
    },
    "skills": {
        "title2": "Skills"
        
    },
    "soft-skills" : {
        "sentence1": "Solving problems and building solutions",
        "sentence2": "Self-learning and overcome fallbacks",
        "sentence3": "Working well in a team",
        "sentence4": "Having a creative mindset",
        "sentence5": "Having attention to detail"
    },
    "projects": {
        "title2": "Projects",
        "github-link": "Link to the GitHub repository",
        "booki": {
            "title" : "OpenClassrooms - Project 2",
            "description": "This was my first project where I had to turn a mockup into a responsive web page using HTML and CSS, including mobile, tablet, and desktop versions. I ensured web semantics, compatibility with Google Chrome and Mozilla Firefox, and code validity with W3C HTML and CSS validators.",
            "website-link": "Link to the website"
        },
        "sophie-bluel": {
            "title" : "OpenClassrooms - Project 3",
            "description": "For this project, I used JavaScript to implement several features, such as dynamically fetching data from an API and filtering it. I also integrated a login page and a modal that allows to add, modify, and delete data, both on the page and on the API.",
            "website-link": "Link to the website"
        },
        "qwenta": {
            "title" : "OpenClassrooms - Project 4",
            "description": "This project is the only one that does not contain any code, consisting of the planning of website development. Therefore, I wrote the technical specifications, researched various technical aspects of the project, and set up a Kanban board for project management.",
            "website-link": "Click to download the project"
        },
        "nina-carducci": {
            "title" : "OpenClassrooms - Project 5",
            "description": "For this project, I had to optimize the website's images, code, and structure. I also debugged the site's functionalities that were not working and added local SEO and social media integration using meta tags and Schema.org.",
            "website-link": "Link to the website"
        },
        "kasa": {
            "title" : "OpenClassrooms - Project 6",
            "description": "For this React project, I used React Router to configure page navigation, created React components for different pages, added CSS animations with SASS, and implemented a 404 page for non-existent routes.",
            "website-link": "Link to the website"
        },
        "mon-vieux-grimoire": {
            "title" : "OpenClassrooms - Project 7",
            "description": "This was the last project of my OpenClassrooms training with a roadmap. This time, I built an Express server, a RESTful API, set up an authentication system, and implemented CRUD operations securely.",
            "website-link": "Link to the website"
        },
        "my-portfolio": {
            "title" : "OpenClassrooms - Project 8",
            "description": "This portfolio was my first independent project from start to finish. I initialized it with Vite and learned new technologies such as TypeScript and Tailwind. I implemented important features to me such as the translation with the i18n library; as well as the modal that provides details on each project I built during my training.",
            "website-link": "You already are on my portfolio !"
        }
    },
    "footer": {
        "title": "Contact:",
        "copyright": "© 2023 Matias Larralde's Portfolio - All rights reserved.",
        "legal-notice": "Legal notice",
        "legal-notice-content": {
            "sentence1": "The site is hosted by ~~~Amazon Web Services Limited Liability Company (LLC)~~~ whose address is as follows:",
            "sentence2": "~~~Amazon Web Services, Inc. 410 Terry Ave North Seattle , WA 98109-5210 , US.~~~",
            "sentence3": "Phone number: ~~~+ 33 1 74 18 10 38~~~"
        },
        "privacy-policy": "Privacy policy",
        "privacy-policy-content": {
            "sentence1": "We do not collect any personal information from users of this website.",
            "sentence2": "We do not use cookies to collect any personal information.",
            "sentence3": "If you have any questions or concerns about our privacy policy, please contact us at matias.larralde97@gmail.com."
        }
    }
}

