
{
    "categories": {
        "about": "A Propos",
        "skills": "Competences",
        "projects": "Projets",
        "contact": "Coordonnees",
        "language": "FR/EN"
    },
    "about": {
        "title1": "Bonjour ! Je m'appelle Matias Larralde et je suis honoré que vous preniez le temps de regarder mon portfolio.",
        "sentence1": "Je viens de milieux très variés, ayant travaillé dans la restauration, l'organisation d'événements et l'agriculture urbaine.",
        "sentence2": "J'ai beaucoup grandi en tant qu'être humain grâce à ces expériences et je suis heureux d'avoir acquis de nombreuses compétences que je peux maintenant utiliser dans le développement web.",
        "sentence3": "Résoudre des problèmes et créer des solutions, seul ou en équipe, ainsi que posséder un esprit créatif et une grande attention aux détails, sont des compétences qui font maintenant partie de moi !",
        "sentence4": "Cela renforce ma soif d'apprendre et de maîtriser de nouvelles technologies, langages de programmation ou frameworks. Chaque nouveau jour est un nouveau défi !",
        "sentence5": "Je sais que j'ai trouvé ma voie dans la programmation."
    },
    "skills": {
        "title2": "Compétences"
        
    },
    "soft-skills" : {
        "sentence1": "Aimer résoudre des problèmes et trouver des solutions",
        "sentence2": "Savoir apprendre tout seul",
        "sentence3": "Savoir travailler en équipe",
        "sentence4": "Avoir un esprit créatif",
        "sentence5": "Avoir le sens du détail"
    },
    "projects": {
        "title2": "Projets",
        "github-link": "Lien vers le repository GitHub",
        "booki": {
            "title" : "OpenClassrooms - Projet 2",
            "description": "Ce fût mon premier projet où j'ai dû transformer une maquette en une page web responsive en utilisant HTML et CSS, comprenant versions mobiles, tablettes et ordinateurs. J'ai veillé à respecter la sémantique web, la compatibilité avec Google Chrome et Mozilla Firefox, et vérifié mon code avec les validateurs HTML et CSS du W3C.",
            "website-link": "Lien vers le site"
        },
        "sophie-bluel": {
            "title" : "OpenClassrooms - Projet 3",
            "description": "Pour ce projet, j'ai implémenté plusieurs fonctionnalités en JavaScript, notamment la récupération de données depuis une API avec fetch, ainsi que le filtrage de celle-ci. J'ai également intégré une page de connexion et une modale permettant l'ajout, la modification et la suppression de données, à la fois sur la page et sur l'API.",
            "website-link": "Lien vers le site"
        },
        "qwenta": {
            "title" : "OpenClassrooms - Projet 4",
            "description": "Ce projet est le seul qui ne contient pas de code, consitant en la planification du développement d'un site. J'ai donc réalisé les spécifications techniques, effectué une veille des différents aspects techniques du projet, et mis en place un tableau Kanban pour la gestion du projet.",
            "website-link": "Cliquez pour télécharger le projet"
        },
        "nina-carducci": {
            "title" : "OpenClassrooms - Projet 5",
            "description": "Pour ce projet, j'ai dû optimiser les images du site, son code ainsi que sa structure. J'ai également débogué les fonctionnalités du site qui ne fonctionnaient pas et ajouté le référencement local et les réseaux sociaux en utilisant les balises meta et Schema.org.",
            "website-link": "Lien vers le site"
        },
        "kasa": {
            "title" : "OpenClassrooms - Projet 6",
            "description": "Pour ce projet React, j'ai utilisé React Router pour configurer la navigation entre les pages, conçu des composants React utilisés ensuite dans les différentes pages, réalisé des animations CSS avec SASS, et implémenté une page 404 pour les routes inexistantes.",
            "website-link": "Lien vers le site"
        },
        "mon-vieux-grimoire": {
            "title" : "OpenClassrooms - Projet 7",
            "description": "Ce fût le dernier projet de ma formation OpenClassrooms avec une feuille de route. Cette fois-ci, j'ai conçu un serveur Express, une API RESTful, mis en place un système d'authentification et implémenté des opérations CRUD de manière sécurisée.",
            "website-link": "Lien vers le site"
        },
        "my-portfolio": {
            "title" : "OpenClassrooms - Projet 8",
            "description": "Ce portfolio était mon premier projet libre de A à Z. Je l'ai initialisé avec Vite et j'ai appris de nouvelles technologies telles que TypeScript et Tailwind. Les fonctionnalités qui me tenait le plus à cœur d'intégrer sont la traduction avec la librairie i18n; ainsi que la fenêtre qui apporte des précisions sur chacun des projets réalisé lors de ma formation.",
            "website-link": "Vous êtes déjà sur le portfolio !"
        }
    },
    "footer": {
        "title": "Coordonnées:",
        "copyright": "© 2023 Portfolio - Matias Larralde - Tous droits réservés.",
        "legal-notice": "Mentions légales",
        "legal-notice-content": {
            "sentence1": "Le site est hébergé par ~~~Amazon Web Services Limited Liability Company (LLC)~~~ dont l’adresse est la suivante:",
            "sentence2": "~~~Amazon Web Services, Inc. 410 Terry Ave North Seattle , WA 98109-5210 , US~~~",
            "sentence3": "Téléphone: ~~~~0 800 84 77 15~~~"
        },
        "privacy-policy": "Politique de confidentialité",
        "privacy-policy-content": {
            "sentence1": "Nous ne collectons aucune information personnelle des utilisateurs de ce site web.",
            "sentence2": "Nous n'utilisons pas de cookies pour collecter des informations personnelles.",
            "sentence3": "Si vous avez des questions ou des préoccupations concernant notre politique de confidentialité, veuillez nous contacter à matias.larralde97@gmail.com."
        }
    }
}



