
{
    "head": {
        "title": "Matias Larralde - Portfolio",
        "description": ""
    },
    "categories": {
        "about": "A Propos",
        "skills": "Compétences",
        "projects": "Projets",
        "contact": "Coordonnées",
        "language": "FR/EN"
    },
    "about": {
        "title1": "Bonjour ! Je suis Matias Larralde et je suis ravi que vous jetiez un coup d'oeil à mon portfolio.",
        "sentence1": "Je viens de milieux très variés, ayant travaillé dans la restauration, l'organisation d'événements et l'agriculture urbaine.",
        "sentence2": "J'ai beaucoup grandi en tant qu'être humain grâce à ces expériences et je suis heureux d'avoir acquis de nombreuses compétences que je peux maintenant utiliser dans le développement web.",
        "sentence3": "Cela renforce ma soif d'apprendre et de maîtriser de nouvelles technologies, langages de programmation ou frameworks. Chaque nouveau jour est un nouveau défi !",
        "sentence4": "Je suis fier de tout ce que j'ai appris et accompli lors de ma formation de développeur web avec OpenClassrooms.",
        "sentence5": "Je sais que j'ai trouvé ma voie dans la programmation."
    },
    "skills": {
        "title2": "Compétences"
        
    },
    "soft-skills" : {
        "sentence1": "Aimer résoudre des problèmes et trouver des solutions",
        "sentence2": "Savoir apprendre tout seul",
        "sentence3": "Savoir travailler en équipe",
        "sentence4": "Avoir un esprit créatif",
        "sentence5": "Avoir le sens du détail"
    },
    "projects": {
        "title2": "Projets",
        "github-link": "Lien vers le repository GitHub",
        "booki": {
            "title" : "OpenClassrooms - Projet 2",
            "description": "Ce fût mon premier projet où j'ai dû transformer une maquette en une page web responsive en utilisant HTML et CSS, comprenant versions mobiles, tablettes et ordinateurs. J'ai veillé à respecter la sémantique web, la compatibilité avec Google Chrome et Mozilla Firefox, et vérifié mon code avec les validateurs HTML et CSS du W3C.",
            "website-link": "Lien vers le site",
            "difficulties": "Je n'ai pas vraiment rencontré de difficultés.",
            "technologies": "J'ai utilisé HTML et CSS pour ce projet."
        },
        "sophie-bluel": {
            "title" : "OpenClassrooms - Projet 3",
            "description": "Pour ce projet, j'ai implémenté plusieurs fonctionnalités en JavaScript, notamment la récupération de données depuis une API avec fetch, ainsi que le filtrage de celle-ci. J'ai également intégré une page de connexion et une modale permettant l'ajout, la modification et la suppression de données, à la fois sur la page et sur l'API.",
            "website-link": "Lien vers le site",
            "difficulties": "J'ai rencontré un soucis après avoir push mon backend sur GitHub, j'ai donc créé un nouveau repository pour ce projet.",
            "technologies": "J'ai utilisé HTML, CSS et JavaScript pour ce projet."
        },
        "qwenta": {
            "title" : "OpenClassrooms - Projet 4",
            "description": "Ce projet est le seul qui ne contient pas de code, consitant en la planification du développement d'un site. J'ai donc réalisé les spécifications techniques, effectué une veille des différents aspects techniques du projet, et mis en place un tableau Kanban pour la gestion du projet.",
            "website-link": "Cliquez pour télécharger le projet",
            "difficulties": "J'ai eu des difficultés à écrire correctement mes spécifications techniques, mais après de bonnes recherches, j'ai réussi!",
            "technologies": "J'ai utilisé Google Slides, Notion and Wakelet pour ce projet."
        },
        "nina-carducci": {
            "title" : "OpenClassrooms - Projet 5",
            "description": "Pour ce projet, j'ai dû optimiser les images du site, son code ainsi que sa structure. J'ai également débogué les fonctionnalités du site qui ne fonctionnaient pas et ajouté le référencement local et les réseaux sociaux en utilisant les balises meta et Schema.org.",
            "website-link": "Lien vers le site",
            "difficulties": "Il m'a fallu un peu de temps pour maîtriser l'optimisation des images.",
            "technologies": "J'ai utilisé HTML, CSS et JavaScript ainsi que divers outils analytiques tels que Google Lighthouse pour ce projet."
        },
        "kasa": {
            "title" : "OpenClassrooms - Projet 6",
            "description": "Pour ce projet React, j'ai utilisé React Router pour configurer la navigation entre les pages, conçu des composants React utilisés ensuite dans les différentes pages, réalisé des animations CSS avec SASS, et implémenté une page 404 pour les routes inexistantes.",
            "website-link": "Lien vers le site",
            "difficulties": "J'ai eu un peu de mal à réaliser le fetch des données d'un logement, mais avec persévérence j'ai réussi.",
            "technologies": "J'ai utilisé React.js et Sass pour ce projet."
        },
        "mon-vieux-grimoire": {
            "title" : "OpenClassrooms - Projet 7",
            "description": "Ce fût le dernier projet de ma formation OpenClassrooms avec une feuille de route. Cette fois-ci, j'ai conçu un serveur Express, une API RESTful, mis en place un système d'authentification et implémenté des opérations CRUD de manière sécurisée.",
            "website-link": "Lien vers le site",
            "difficulties": "J'ai eu des difficultés à utiliser Sharp pour optimiser les images, mais lorsque j'ai trouvé comment renommer correctement le fichier optimisé, tout a fonctionné!",
            "technologies": "J'ai utilisé Node.js et Express.js pour ce projet."
        },
        "my-portfolio": {
            "title" : "OpenClassrooms - Projet 8",
            "description": "Ce portfolio était mon premier projet libre de A à Z. Je l'ai initialisé avec Vite et j'ai appris de nouvelles technologies telles que TypeScript et Tailwind. Les fonctionnalités qui me tenait le plus à cœur d'intégrer sont la traduction avec la librairie i18n; ainsi que la fenêtre qui apporte des précisions sur chacun des projets réalisé lors de ma formation.",
            "website-link": "Vous êtes déjà sur le portfolio !",
            "difficulties": "Le choix de couleurs ne fût pas facile étant daltonien, mais après de nombreux essais, j'en suis maintenant satisfait.",
            "technologies": "J'ai utilisé React, Typescript et Tailwind pour ce projet."
        }
    },
    "footer": {
        "title": "Coordonnées:",
        "copyright": "© 2023 Portfolio - Matias Larralde - Tous droits réservés.",
        "legal-notice": "Mentions légales",
        "legal-notice-content": {
            "sentence1": "Le site est hébergé par ~~~Amazon Web Services Limited Liability Company (LLC)~~~ dont l’adresse est la suivante:",
            "sentence2": "~~~Amazon Web Services, Inc. 410 Terry Ave North Seattle , WA 98109-5210 , US~~~",
            "sentence3": "Téléphone: ~~~~0 800 84 77 15~~~"
        },
        "privacy-policy": "Politique de confidentialité",
        "privacy-policy-content": {
            "sentence1": "Nous ne collectons aucune information personnelle des utilisateurs de ce site web.",
            "sentence2": "Nous n'utilisons pas de cookies pour collecter des informations personnelles.",
            "sentence3": "Si vous avez des questions ou des préoccupations concernant notre politique de confidentialité, veuillez nous contacter à matias.larralde97@gmail.com."
        }
    },
    "link": {
        "home" : "Retourner à la page principale"
    },
    "legal-notice": {
        "title": "Mentions Légales",
        "definitions": {
            "client": "Tout professionnel ou personne physique capable au sens des articles 1123 et suivants du Code civil, ou personne morale, qui visite le Site objet des présentes conditions générales.",
            "prestations-services": "https://matias-larralde.fr met à disposition des Clients :",
            "contenu": "Ensemble des éléments constituants l’information présente sur le Site, notamment textes – images – vidéos.",
            "informations-clients": "Ci après dénommé « Information (s) » qui correspondent à l’ensemble des données personnelles susceptibles d’être détenues par https://matias-larralde.fr pour la gestion de votre compte, de la gestion de la relation client et à des fins d’analyses et de statistiques.",
            "utilisateur": "Internaute se connectant, utilisant le site susnommé.",
            "informations-personnelles": "« Les informations qui permettent, sous quelque forme que ce soit, directement ou non, l'identification des personnes physiques auxquelles elles s'appliquent » (article 4 de la loi n° 78-17 du 6 janvier 1978). Les termes « données à caractère personnel », « personne concernée », « sous traitant » et « données sensibles » ont le sens défini par le Règlement Général sur la Protection des Données (RGPD : n° 2016-679)"
          },
          "presentation-site": {
            "title": "Présentation du site internet.",
            "content": "En vertu de l'article 6 de la loi n° 2004-575 du 21 juin 2004 pour la confiance dans l'économie numérique, il est précisé aux utilisateurs du site internet https://matias-larralde.fr l'identité des différents intervenants dans le cadre de sa réalisation et de son suivi:",
            "proprietaire": "Matias Larralde – 94 rue de Varenne 75007 Paris"
          }
    },
    "privacy-policy": {
        "title": "Politique de confidentialité"
    }

}



