
{
    "categories": {
        "about": "A Propos",
        "skills": "Competences",
        "projects": "Projets",
        "contact": "Coordonnees",
        "language": "FR/EN"
    },
    "about": {
        "title1": "Bonjour ! Je m'appelle Matias Larralde et je suis honoré que vous preniez le temps de regarder mon portfolio.",
        "sentence1": "Je viens de milieux très variés, ayant travaillé dans la restauration, l'organisation d'événements et l'agriculture urbaine.",
        "sentence2": "J'ai beaucoup grandi en tant qu'être humain grâce à ces expériences et je suis heureux d'avoir acquis de nombreuses compétences que je peux maintenant utiliser dans le développement web.",
        "sentence3": "Résoudre des problèmes et créer des solutions, seul ou en équipe, ainsi que posséder un esprit créatif et une grande attention aux détails, sont des compétences qui font maintenant partie de moi !",
        "sentence4": "Cela renforce ma soif d'apprendre et de maîtriser de nouvelles technologies, langages de programmation ou frameworks. Chaque nouveau jour est un nouveau défi !",
        "sentence5": "Je sais que j'ai trouvé ma voie dans la programmation."
    },
    "skills": {
        "title2": "Compétences"
        
    },
    "projects": {
        "title2": "Projets"
    },


    "footer": {
        "title": "Coordonnées:",
        "copyright": "© 2023 Portfolio - Matias Larralde - Tous droits réservés.",
        "legal-notice": "Mentions légales",
        "legal-notice-content": {
            "sentence1": "Le site est hébergé par ~~~Amazon Web Services Limited Liability Company (LLC)~~~ dont l’adresse est la suivante:",
            "sentence2": "~~~Amazon Web Services, Inc. 410 Terry Ave North Seattle , WA 98109-5210 , US~~~",
            "sentence3": "Téléphone: ~~~~0 800 84 77 15~~~"
        },
        "privacy-policy": "Politique de confidentialité",
        "privacy-policy-content": {
            "sentence1": "Nous ne collectons aucune information personnelle des utilisateurs de ce site web.",
            "sentence2": "Nous n'utilisons pas de cookies pour collecter des informations personnelles.",
            "sentence3": "Si vous avez des questions ou des préoccupations concernant notre politique de confidentialité, veuillez nous contacter à matias.larralde97@gmail.com."
        }
    }
}



